# Storing data

In [2]:
dictonary = {"independent" : [1,2,3,4,5,6,7,8,9], "dependent" : [10,11,12,13,14,15,16,17,18,19]}

print(dictonary["independent"])

[1, 2, 3, 4, 5, 6, 7, 8, 9]

# Pandas

In [60]:
import pandas as pd

# DataFrames

First we can get data either by generating it or by reading it

In [61]:
data = pd.read_csv("data.csv") # This will read in a locally stored file called `data.csv`

# data = pd.DataFrame() # Used when you are generating data to use, there are a lot of different functions and methods for reading in data see the docs for more information

The returned object now stored in `data` is a `DataFrame` - This is panda's equivalent of an excel sheet.

In [62]:
type(data)

pandas.core.frame.DataFrame

In [63]:
data # Juypter will display the frame for us

              x           y  z
0    123.154675   86.868598  a
1     83.966671   71.911116  a
2     86.307842  100.100997  a
3    135.927615  102.541512  a
4    147.046954   74.312553  a
..          ...         ... ..
107  554.121345  440.471173  a
108  540.367018  457.320256  a
109  573.524085  403.506937  a
110  523.626257  415.569872  a
111  604.143915  452.298369  a

[112 rows x 3 columns]

A DataFrame has built in functions we can call to give us information about the data or technical information on itself

In [64]:
data.describe()

                x           y
count  112.000000  112.000000
mean   364.955075  287.293602
std    134.358070  114.785251
min     83.966671   66.526716
25%    284.300521  182.587590
50%    378.083601  302.856110
75%    478.875195  386.486757
max    604.143915  468.087672

In [65]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112 entries, 0 to 111
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       112 non-null    float64
 1   y       112 non-null    float64
 2   z       112 non-null    object
dtypes: float64(2), object(1)
memory usage: 2.8+ KB

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html

# Selecting columns

A DataFrame is made of multiple Series. We access a series like we would with a dictonary, with the column name as the key

In [66]:
data["x"]

0      123.154675
1       83.966671
2       86.307842
3      135.927615
4      147.046954
          ...
107    554.121345
108    540.367018
109    573.524085
110    523.626257
111    604.143915
Name: x, Length: 112, dtype: float64

# Deleting/Dropping columns

We can delete columns completely or we can create a new dataframe with the columns missing

In [67]:
data_2 = data.drop(columns="x") # We can also do the index

data_2

              y  z
0     86.868598  a
1     71.911116  a
2    100.100997  a
3    102.541512  a
4     74.312553  a
..          ... ..
107  440.471173  a
108  457.320256  a
109  403.506937  a
110  415.569872  a
111  452.298369  a

[112 rows x 2 columns]

In [68]:
# delete a column from memory

data = data.drop(columns="z")

# del data["z"] # this line will also work
# data.drop(columns="z", inplace=True) # as well as this one

data

              x           y
0    123.154675   86.868598
1     83.966671   71.911116
2     86.307842  100.100997
3    135.927615  102.541512
4    147.046954   74.312553
..          ...         ...
107  554.121345  440.471173
108  540.367018  457.320256
109  573.524085  403.506937
110  523.626257  415.569872
111  604.143915  452.298369

[112 rows x 2 columns]

# Selecting specific rows

In [69]:
data.loc[4]

x    147.046954
y     74.312553
Name: 4, dtype: float64

# Selecting specific columns

In [70]:
data.loc[4,"x"]

np.float64(147.04695363855967)

# Filtering and masks

In [71]:
filt = (data["x"] > 300) # using 300 as it's the average value as seen above

filt

0      False
1      False
2      False
3      False
4      False
       ...
107     True
108     True
109     True
110     True
111     True
Name: x, Length: 112, dtype: bool

In [72]:
data.loc[filt]

              x           y
27   304.835214  183.453381
29   311.548819  169.081712
32   314.818915  223.370782
36   341.991323  218.808220
37   324.141717  260.655199
..          ...         ...
107  554.121345  440.471173
108  540.367018  457.320256
109  573.524085  403.506937
110  523.626257  415.569872
111  604.143915  452.298369

[77 rows x 2 columns]

# Correlation

In [73]:
data.corr()

          x         y
x  1.000000  0.953712
y  0.953712  1.000000